##### PS : I started off with just .py not realizing I had to do this in jupyter so I am redoing this in my last 30mins of class hopefully it's okay. :) I still dont know how Jupyter works so here's my go.
## 1) Setup

In [31]:
import numpy as np
import pandas as pd

# Just wanted to see all the data without truncation
pd.set_option('display.max_rows', None)
pd.set_option('display.max_columns', None)
pd.set_option('display.width', None)
pd.set_option('display.max_colwidth', None)

## 2) Load Data

In [32]:
csv_path = "NSMES1988 - NSMES1988.csv"
df = pd.read_csv(csv_path)
print("Load shape:", df.shape)
df.head(10)

Load shape: (4406, 19)

,Unnamed: 0,visits,nvisits,ovisits,novisits,emergency,hospital,health,chronic,adl,region,age,gender,married,school,income,employed,insurance,medicaid
0,1,5,0,0,0,0,1,average,2,normal,other,6.9,male,yes,6,2.8810,yes,yes,no
1,2,1,0,2,0,2,0,average,2,normal,other,7.4,female,yes,10,2.7478,no,yes,no
2,3,13,0,0,0,3,3,poor,4,limited,other,6.6,female,no,10,0.6532,no,no,yes
3,4,16,0,5,0,1,1,poor,2,limited,other,7.6,male,yes,3,0.6588,no,yes,no
4,5,3,0,0,0,0,0,average,2,limited,other,7.9,female,yes,6,0.6588,no,yes,no
5,6,17,0,0,0,0,0,poor,5,limited,other,6.6,female,no,7,0.3301,no,no,yes
6,7,9,0,0,0,0,0,average,0,normal,midwest,7.5,female,no,8,0.8280,no,yes,no
7,8,3,0,0,0,0,0,average,0,normal,midwest,8.7,female,no,8,3.0456,no,yes,no
8,9,1,0,0,0,0,0,average,0,normal,midwest,7.3,female,no,8,3.0456,no,yes,no
9,10,0,0,0,0,0,0,average,0,normal,midwest,7.8,female,no,8,3.0456,no,yes,no

## 3) Overview
I noticed there was numeber 0 as actually the row numbers and also age should be int and income should also be int....

My initial Go for age was this "df.loc[df['age'] < 11, 'age'] = df['age'] * 10" which was working fine till I noticed age also was a single integer.

In [33]:
print(df.columns)
print(df.dtypes)
df.info()
df.describe()
df.describe(include='object')

Index(['Unnamed: 0', 'visits', 'nvisits', 'ovisits', 'novisits', 'emergency',
       'hospital', 'health', 'chronic', 'adl', 'region', 'age', 'gender',
       'married', 'school', 'income', 'employed', 'insurance', 'medicaid'],
      dtype='object')
Unnamed: 0      int64
visits          int64
nvisits         int64
ovisits         int64
novisits        int64
emergency       int64
hospital        int64
health         object
chronic         int64
adl            object
region         object
age           float64
gender         object
married        object
school          int64
income        float64
employed       object
insurance      object
medicaid       object
dtype: object
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4406 entries, 0 to 4405
Data columns (total 19 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  4406 non-null   int64
 1   visits      4406 non-null   int64
 2   nvisits     4406 non-null   int64
 3   ovisits     4406 non-null   int64
 4   novisits    4406 non-null   int64
 5   emergency   4406 non-null   int64
 6   hospital    4406 non-null   int64
 7   health      4406 non-null   object
 8   chronic     4406 non-null   int64
 9   adl         4406 non-null   object
 10  region      4406 non-null   object
 11  age         4406 non-null   float64
 12  gender      4406 non-null   object
 13  married     4406 non-null   object
 14  school      4406 non-null   int64
 15  income      4406 non-null   float64
 16  employed    4406 non-null   object
 17  insurance   4406 non-null   object
 18  medicaid    4406 non-null   object
dtypes: float64(2), int64(9), object(8)
memory usage: 654.1+ KB

         health     adl region  gender married employed insurance medicaid
count      4406    4406   4406    4406    4406     4406      4406     4406
unique        3       2      4       2       2        2         2        2
top     average  normal  other  female     yes       no       yes       no
freq       3509    3507   1614    2628    2406     3951      3421     4004

## 4) Missing Values

In [34]:
print(df.isnull().sum())

Unnamed: 0    0
visits        0
nvisits       0
ovisits       0
novisits      0
emergency     0
hospital      0
health        0
chronic       0
adl           0
region        0
age           0
gender        0
married       0
school        0
income        0
employed      0
insurance     0
medicaid      0
dtype: int64

## 5) Row 287 Concern
If i convert all my ages to 10x then the 8 year old will be 80 I need to find a way to change my age to only everything after 10 is times 10.

In [35]:
display(df.iloc[[287]])
print("Age at row 287:", age_val)

,Unnamed: 0,visits,nvisits,ovisits,novisits,emergency,hospital,health,chronic,adl,region,age,gender,married,school,income,employed,insurance,medicaid
287,288,6,1,0,0,0,0,average,2,limited,midwest,8.0,female,no,6,0.468,no,yes,no

Age at row 287: 8.0

## 5) Export JSON as NSMES1988.json
Was I supposed to clean the file? Next time I will do better with this capstone assignments :(

In [37]:
df = pd.read_csv("NSMES1988 - NSMES1988.csv")
df.to_json("NSMES1988.json", orient="records", indent=4)
print("File exported as 'NSMES1988.json'")

File exported as 'NSMES1988.json'